Oryx-Embedded/CycloneTCP/drivers/mac/gd32h7xx_eth2_driver.c
/**
 * @file gd32h7xx_eth2_driver.c
 * @brief GigaDevice GD32H7 Ethernet MAC driver (ENET1 instance)
 *
 * @section License
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 *
 * Copyright (C) 2010-2026 Oryx Embedded SARL. All rights reserved.
 *
 * This file is part of CycloneTCP Open.
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * as published by the Free Software Foundation; either version 2
 * of the License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software Foundation,
 * Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.
 *
 * @author Oryx Embedded SARL (www.oryx-embedded.com)
 * @version 2.6.2
 **/

//Switch to the appropriate trace level
#define TRACE_LEVEL NIC_TRACE_LEVEL

//Dependencies
#include "gd32h7xx.h"
#include "core/net.h"
#include "drivers/mac/gd32h7xx_eth2_driver.h"
#include "debug.h"

//Underlying network interface
static NetInterface *nicDriverInterface;

//IAR EWARM compiler?
#if defined(__ICCARM__)

//Transmit buffer
#pragma data_alignment = 4
#pragma location = STM32H7XX_ETH2_RAM_SECTION
static uint8_t txBuffer[GD32H7XX_ETH2_TX_BUFFER_COUNT][GD32H7XX_ETH2_TX_BUFFER_SIZE];
//Receive buffer
#pragma data_alignment = 4
#pragma location = STM32H7XX_ETH2_RAM_SECTION
static uint8_t rxBuffer[GD32H7XX_ETH2_RX_BUFFER_COUNT][GD32H7XX_ETH2_RX_BUFFER_SIZE];
//Transmit DMA descriptors
#pragma data_alignment = 4
#pragma location = STM32H7XX_ETH2_RAM_SECTION
static Gd32h7xxEth2TxDmaDesc txDmaDesc[GD32H7XX_ETH2_TX_BUFFER_COUNT];
//Receive DMA descriptors
#pragma data_alignment = 4
#pragma location = STM32H7XX_ETH2_RAM_SECTION
static Gd32h7xxEth2RxDmaDesc rxDmaDesc[GD32H7XX_ETH2_RX_BUFFER_COUNT];

//Keil MDK-ARM or GCC compiler?
#else

//Transmit buffer
static uint8_t txBuffer[GD32H7XX_ETH2_TX_BUFFER_COUNT][GD32H7XX_ETH2_TX_BUFFER_SIZE]
   __attribute__((aligned(4), __section__(STM32H7XX_ETH2_RAM_SECTION)));
//Receive buffer
static uint8_t rxBuffer[GD32H7XX_ETH2_RX_BUFFER_COUNT][GD32H7XX_ETH2_RX_BUFFER_SIZE]
   __attribute__((aligned(4), __section__(STM32H7XX_ETH2_RAM_SECTION)));
//Transmit DMA descriptors
static Gd32h7xxEth2TxDmaDesc txDmaDesc[GD32H7XX_ETH2_TX_BUFFER_COUNT]
   __attribute__((aligned(4), __section__(STM32H7XX_ETH2_RAM_SECTION)));
//Receive DMA descriptors
static Gd32h7xxEth2RxDmaDesc rxDmaDesc[GD32H7XX_ETH2_RX_BUFFER_COUNT]
   __attribute__((aligned(4), __section__(STM32H7XX_ETH2_RAM_SECTION)));

#endif

//Pointer to the current TX DMA descriptor
static Gd32h7xxEth2TxDmaDesc *txCurDmaDesc;
//Pointer to the current RX DMA descriptor
static Gd32h7xxEth2RxDmaDesc *rxCurDmaDesc;


/**
 * @brief GD32H7 Ethernet MAC driver (ENET1 instance)
 **/

const NicDriver gd32h7xxEth2Driver =
{
   NIC_TYPE_ETHERNET,
   ETH_MTU,
   gd32h7xxEth2Init,
   gd32h7xxEth2Tick,
   gd32h7xxEth2EnableIrq,
   gd32h7xxEth2DisableIrq,
   gd32h7xxEth2EventHandler,
   gd32h7xxEth2SendPacket,
   gd32h7xxEth2UpdateMacAddrFilter,
   gd32h7xxEth2UpdateMacConfig,
   gd32h7xxEth2WritePhyReg,
   gd32h7xxEth2ReadPhyReg,
   TRUE,
   TRUE,
   TRUE,
   FALSE
};


/**
 * @brief GD32H7 Ethernet MAC initialization
 * @param[in] interface Underlying network interface
 * @return Error code
 **/

error_t gd32h7xxEth2Init(NetInterface *interface)
{
   error_t error;

   //Debug message
   TRACE_INFO("Initializing GD32H7 Ethernet MAC (ENET1)...\r\n");

   //Save underlying network interface
   nicDriverInterface = interface;

   //GPIO configuration
   gd32h7xxEth2InitGpio(interface);

   //Enable Ethernet MAC clock
   rcu_periph_clock_enable(RCU_ENET1);
   rcu_periph_clock_enable(RCU_ENET1TX);
   rcu_periph_clock_enable(RCU_ENET1RX);

   //Reset Ethernet MAC peripheral
   rcu_periph_reset_enable(RCU_ENET1RST);
   rcu_periph_reset_disable(RCU_ENET1RST);

   //Perform a software reset
   ENET_DMA_BCTL(ENET1) |= ENET_DMA_BCTL_SWR;
   //Wait for the reset to complete
   while((ENET_DMA_BCTL(ENET1) & ENET_DMA_BCTL_SWR) != 0)
   {
   }

   //Adjust MDC clock range depending on HCLK frequency
   ENET_MAC_PHY_CTL(ENET1) = ENET_MDC_HCLK_DIV62;

   //Valid Ethernet PHY or switch driver?
   if(interface->phyDriver != NULL)
   {
      //Ethernet PHY initialization
      error = interface->phyDriver->init(interface);
   }
   else if(interface->switchDriver != NULL)
   {
      //Ethernet switch initialization
      error = interface->switchDriver->init(interface);
   }
   else
   {
      //The interface is not properly configured
      error = ERROR_FAILURE;
   }

   //Any error to report?
   if(error)
   {
      return error;
   }

   //Use default MAC configuration
   ENET_MAC_CFG(ENET1) = ENET_MAC_CFG_ROD;

   //Set the MAC address of the station
   ENET_MAC_ADDR0L(ENET1) = interface->macAddr.w[0] | (interface->macAddr.w[1] << 16);
   ENET_MAC_ADDR0H(ENET1) = interface->macAddr.w[2] | ENET_MAC_ADDR0H_MO;

   //The MAC supports 3 additional addresses for unicast perfect filtering
   ENET_MAC_ADDR1L(ENET1) = 0;
   ENET_MAC_ADDR1H(ENET1) = 0;
   ENET_MAC_ADDR2L(ENET1) = 0;
   ENET_MAC_ADDT2H(ENET1) = 0;
   ENET_MAC_ADDR3L(ENET1) = 0;
   ENET_MAC_ADDR3H(ENET1) = 0;

   //Initialize hash table
   ENET_MAC_HLL(ENET1) = 0;
   ENET_MAC_HLH(ENET1) = 0;

   //Configure the receive filter
   ENET_MAC_FRMF(ENET1) = ENET_MAC_FRMF_HPFLT | ENET_MAC_FRMF_HMF;
   //Disable flow control
   ENET_MAC_FCTL(ENET1) = 0;
   //Enable store and forward mode
   ENET_DMA_CTL(ENET1) = ENET_DMA_CTL_RSFD | ENET_DMA_CTL_TSFD;

   //Configure DMA bus mode
   ENET_DMA_BCTL(ENET1) = ENET_DMA_BCTL_AA | ENET_DMA_BCTL_UIP | ENET_RXDP_32BEAT |
      ENET_ARBITRATION_RXTX_1_1 | ENET_PGBL_32BEAT | ENET_DMA_BCTL_DFM;

   //Initialize DMA descriptor lists
   gd32h7xxEth2InitDmaDesc(interface);

